In [1]:
import numpy as np
import pandas as pd

### Series

In [3]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
dic={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
# Mesmo funções (embora seja improvável que você use isso)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
arr1=np.arange(1,5)
arr2=np.arange(1,5)

In [21]:
ser01=pd.Series(arr1,index=['EUA', 'Alemanha','USSR', 'Japão'])

In [22]:
ser01

EUA         1
Alemanha    2
USSR        3
Japão       4
dtype: int64

In [23]:
ser02=pd.Series(arr2,index=['Italia', 'Alemanha','EUA', 'Japão'])

In [24]:
ser02

Italia      1
Alemanha    2
EUA         3
Japão       4
dtype: int64

In [25]:
ser01+ser02

Alemanha    4.0
EUA         4.0
Italia      NaN
Japão       8.0
USSR        NaN
dtype: float64

### DataFrames

In [2]:
np.random.seed(101)

In [3]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [6]:
df=pd.DataFrame(np.random.randn(5,5),index='1 2 3 4 5'.split(),columns='A B C D E'.split())

In [7]:
df

          A         B         C         D         E
1  1.035125 -0.031160  1.939932 -1.005187 -0.741790
2  0.187125 -0.732845 -1.382920  1.482495  0.961458
3 -2.141212  0.992573  1.192241 -1.046780  1.292765
4 -1.467514 -0.494095 -0.162535  0.485809  0.392489
5  0.221491 -0.855196  1.541990  0.666319 -0.538235

In [9]:
df2=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [10]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [17]:
df2['W']

A   -0.568581
B   -0.391157
C    0.720788
D   -1.385379
E   -0.771329
Name: W, dtype: float64

In [18]:
# Passando uma lista com nomes das colunas
df2[['W','Z']]

          W         Z
A -0.568581 -0.905100
B -0.391157 -0.866885
C  0.720788 -1.115710
D -1.385379 -0.411055
E -0.771329  0.253548

In [19]:
# Sintaxe SQL (Não recomendado!)
df2.W

A   -0.568581
B   -0.391157
C    0.720788
D   -1.385379
E   -0.771329
Name: W, dtype: float64

As colunas dos DataFrames são Series

In [21]:
type(df2['W'])

pandas.core.series.Series

** Criando uma coluna: **

In [22]:
df2['new']=df2['W']+df2['Y']

In [23]:
df2

          W         X         Y         Z       new
A -0.568581  1.407338  0.641806 -0.905100  0.073224
B -0.391157  1.028293 -1.972605 -0.866885 -2.363762
C  0.720788 -1.223082  1.606780 -1.115710  2.327567
D -1.385379 -1.329660  0.041460 -0.411055 -1.343919
E -0.771329  0.110477 -0.804652  0.253548 -1.575980

** Removendo colunas **

In [26]:
df2.drop('new',axis=1)

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [27]:
df2

          W         X         Y         Z       new
A -0.568581  1.407338  0.641806 -0.905100  0.073224
B -0.391157  1.028293 -1.972605 -0.866885 -2.363762
C  0.720788 -1.223082  1.606780 -1.115710  2.327567
D -1.385379 -1.329660  0.041460 -0.411055 -1.343919
E -0.771329  0.110477 -0.804652  0.253548 -1.575980

In [28]:
df2.drop('new',axis=1,inplace=True)

In [29]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

Também podemos deletar linhas desta forma:

In [30]:
df2.drop('E',axis=0)

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055

In [31]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

** Selecionando linhas: **

In [33]:
df2.loc['A']

W   -0.568581
X    1.407338
Y    0.641806
Z   -0.905100
Name: A, dtype: float64

Ou selecione com base na posição em vez do rótulo

In [37]:
df2.iloc[0]

W   -0.568581
X    1.407338
Y    0.641806
Z   -0.905100
Name: A, dtype: float64

** Selecionando o subconjunto de linhas e colunas **

In [38]:
df2.loc['B','Y']

-1.9726051036093835

In [40]:
df2.loc[['A','B'],['W','Y']]

          W         Y
A -0.568581  0.641806
B -0.391157 -1.972605

In [41]:
df2>0

       W      X      Y      Z
A  False   True   True  False
B  False   True  False  False
C   True  False   True  False
D  False  False   True  False
E  False   True  False   True

In [42]:
df2[df2>0]

          W         X         Y         Z
A       NaN  1.407338  0.641806       NaN
B       NaN  1.028293       NaN       NaN
C  0.720788       NaN  1.606780       NaN
D       NaN       NaN  0.041460       NaN
E       NaN  0.110477       NaN  0.253548

In [46]:
df2[df2['W']>0]

          W         X        Y        Z
C  0.720788 -1.223082  1.60678 -1.11571

In [49]:
df2[df2['W']>0]['Y']

C    1.60678
Name: Y, dtype: float64

In [50]:
df2[df2['W']>0][['Y','Z']]

         Y        Z
C  1.60678 -1.11571

Para duas condições, você pode usar | e & com parênteses:

In [51]:
df2[(df2['W']>0)&(df2['Y']>1)]

          W         X        Y        Z
C  0.720788 -1.223082  1.60678 -1.11571

Redefinir para o padrão 0,1 ... n índice

In [53]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [54]:
df2.reset_index()

  index         W         X         Y         Z
0     A -0.568581  1.407338  0.641806 -0.905100
1     B -0.391157  1.028293 -1.972605 -0.866885
2     C  0.720788 -1.223082  1.606780 -1.115710
3     D -1.385379 -1.329660  0.041460 -0.411055
4     E -0.771329  0.110477 -0.804652  0.253548

In [56]:
novoind = 'CA NY WY OR CO'.split()

In [58]:
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [59]:
df2['estados'] = novoind

In [60]:
df2

          W         X         Y         Z estados
A -0.568581  1.407338  0.641806 -0.905100      CA
B -0.391157  1.028293 -1.972605 -0.866885      NY
C  0.720788 -1.223082  1.606780 -1.115710      WY
D -1.385379 -1.329660  0.041460 -0.411055      OR
E -0.771329  0.110477 -0.804652  0.253548      CO

In [61]:
df2.set_index('estados')

                W         X         Y         Z
estados
CA      -0.568581  1.407338  0.641806 -0.905100
NY      -0.391157  1.028293 -1.972605 -0.866885
WY       0.720788 -1.223082  1.606780 -1.115710
OR      -1.385379 -1.329660  0.041460 -0.411055
CO      -0.771329  0.110477 -0.804652  0.253548

In [63]:
df2

          W         X         Y         Z estados
A -0.568581  1.407338  0.641806 -0.905100      CA
B -0.391157  1.028293 -1.972605 -0.866885      NY
C  0.720788 -1.223082  1.606780 -1.115710      WY
D -1.385379 -1.329660  0.041460 -0.411055      OR
E -0.771329  0.110477 -0.804652  0.253548      CO

In [64]:
df2.set_index('estados',inplace=True)

In [65]:
df2

                W         X         Y         Z
estados
CA      -0.568581  1.407338  0.641806 -0.905100
NY      -0.391157  1.028293 -1.972605 -0.866885
WY       0.720788 -1.223082  1.606780 -1.115710
OR      -1.385379 -1.329660  0.041460 -0.411055
CO      -0.771329  0.110477 -0.804652  0.253548